In [4]:
import database2 as db

In [5]:
# database라는 모듈 안에 있는 MyDB Class 생성
db1 = db.MyDB()

In [10]:
select1 = """
    select * from tran_1
"""
data = db1.sql_query(select1)

In [2]:
## 커스텀하게 만든 모듈을 어떤 파일에서는 사용이 가능하게 하려면
## python내의 환경변수를 확인
import sys

In [8]:
# 환경 변수를 출력 
sys.path[-1].replace('\\', '/')

'c:/Users/moons/AppData/Local/Programs/Python/Python311/Lib/site-packages'

In [ ]:
!pip install pandas

In [9]:
import pandas as pd

In [11]:
# sql을 통해서 받아온 데이터를 표의 형태로 출력
df = pd.DataFrame(data)

In [13]:
df

     transaction_id   price         payment_date customer_id
0       T0000000113  210000  2019-02-01 01:36:57    PL563502
1       T0000000114   50000  2019-02-01 01:37:23    HD678019
2       T0000000116  210000  2019-02-01 02:47:23    IK452215
3       T0000000117  170000  2019-02-01 04:33:46    PL542865
4       T0000000118  120000  2019-02-01 04:36:50    GD372798
...             ...     ...                  ...         ...
4994    T0000005108  210000  2019-06-15 02:42:41    HD315748
4995    T0000005109  150000  2019-06-15 03:36:16    HI215420
4996    T0000005110   50000  2019-06-15 03:44:06    IK880102
4997    T0000005111  210000  2019-06-15 04:14:06    IK074758
4998    T0000005112   50000  2019-06-15 04:42:38    HD444151

[4999 rows x 4 columns]